---
kind: method
id: M:Autodesk.Revit.DB.XYZ.IsZeroLength
zh: 点
source: html/c49661af-4fea-861d-2fcd-c54b6db50d9a.htm
---
# Autodesk.Revit.DB.XYZ.IsZeroLength Method

**中文**: 点

The boolean value that indicates whether this vector is a zero vector.

## Syntax (C#)
```csharp
public bool IsZeroLength()
```

## Remarks
The zero vector's each component is zero within the tolerance (1.0e-09).